results/1/server1/apiary-1.2.3/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.68ms   32.84ms   1.21s    99.87%
    Req/Sec    15.74k     3.36k   30.59k    67.90%
  913391 requests in 30.00s, 127.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 618
Requests/sec:  30446.10
Transfer/sec:      4.24MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.63ms   28.99ms   2.51s    99.87%
    Req/Sec    15.41k     2.32k   28.00k    69.81%
  900130 requests in 30.00s, 125.33MB read
  Socket errors: connect 0, read 22, write 0, timeout 31
Requests/sec:  30004.27
Transfer/sec:      4.18MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.45ms   15.94ms   1.23s    99.53%
    Req/Sec    15.76k     2.58k   27.52k    69.60%
  921076 requests in 30.00s, 128.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 263
Requests/sec:  30699.95
Transfer/sec:      4.27MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.12ms   28.01ms   2.28s    99.87%
    Req/Sec    15.66k     2.61k   29.50k    71.89%
  914109 requests in 30.00s, 127.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 73
Requests/sec:  30468.24
Transfer/sec:      4.24MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.50ms   15.53ms   1.26s    99.55%
    Req/Sec    15.29k     2.13k   24.28k    71.11%
  897111 requests in 30.00s, 124.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 144
Requests/sec:  29903.66
Transfer/sec:      4.16MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.99ms   23.61ms   1.61s    99.76%
    Req/Sec    15.61k     3.06k   28.82k    70.90%
  906124 requests in 30.00s, 126.17MB read
  Socket errors: connect 0, read 0, write 0, timeout 205
Requests/sec:  30203.96
Transfer/sec:      4.21MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.07ms   49.69ms   2.03s    99.84%
    Req/Sec    15.63k     3.94k   30.83k    64.35%
  909464 requests in 30.00s, 126.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 296
Requests/sec:  30315.58
Transfer/sec:      4.22MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.68ms   17.69ms   1.77s    99.55%
    Req/Sec    15.25k     2.21k   25.89k    62.31%
  894925 requests in 30.00s, 124.61MB read
  Socket errors: connect 0, read 0, write 0, timeout 106
Requests/sec:  29830.83
Transfer/sec:      4.15MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.69ms  169.82ms   2.21s    98.74%
    Req/Sec    15.97k     4.95k   40.10k    64.83%
  908291 requests in 30.00s, 126.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 121
Requests/sec:  30275.75
Transfer/sec:      4.22MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.36ms   32.10ms   1.45s    99.89%
    Req/Sec    15.64k     2.72k   30.57k    73.10%
  913075 requests in 30.00s, 127.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 191
Requests/sec:  30435.66
Transfer/sec:      4.24MB
=================== summary ===================
machine:      server1
ghc version:  7.8.4
bench target: apiary-1.2.3
bench:        DEEP
bench mode:   30s * 10
average:      30258.40
stdev:        275.97
=================== oneline ===================
server1,7.8.4,apiary-1.2.3,DEEP,30s,10,30258.40,275.97